Revit 2027 API
ParameterTypeId.ViewScalePulldownImperial Property
 "View Scale"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewScalePulldownImperial { get; }
Public Shared ReadOnly Property ViewScalePulldownImperial As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewScalePulldownImperial {
	ForgeTypeId^ get ();
}
static member ViewScalePulldownImperial : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace